<!-- dflook/terraform-github-actions {"workspace":"docs-gen-2","backend_type":"remote","backend":"4f7203218f63c9b1a25ba437cb6f770c4921f5d49628804b6778d3b2bf23852d","plan_job_ref":"Job Test Terraform cloud #284 at https://github.com/dflook/terraform-github-actions/actions/runs/13548761094","plan_hash":"30b625ad43ee56777687971a834177f9325b45b216dd78b9c80265550ccefed4","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __docs-gen-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #284](https://github.com/dflook/terraform-github-actions/actions/runs/13548761094)